local replacements = {
	
	["a"] = "𐀀",
	["e"] = "𐀁",
	["i"] = "𐀂",
	["o"] = "𐀃",
	["u"] = "𐀄",
	
	["da"] = "𐀅",
	["de"] = "𐀆",
	["di"] = "𐀇",
	["do"] = "𐀈",
	["du"] = "𐀉",
	
	["ja"] = "𐀊",
	["je"] = "𐀋",
	-- ji not in Unicode
	["jo"] = "𐀍",
	["ju"] = "𐀎",
	
	["ka"] = "𐀏",
	["ke"] = "𐀐",
	["ki"] = "𐀑",
	["ko"] = "𐀒",
	["ku"] = "𐀓",
	
	["ma"] = "𐀔",
	["me"] = "𐀕",
	["mi"] = "𐀖",
	["mo"] = "𐀗",
	["mu"] = "𐀘",
	
	["na"] = "𐀙",
	["ne"] = "𐀚",
	["ni"] = "𐀛",
	["no"] = "𐀜",
	["nu"] = "𐀝",
	
	["pa"] = "𐀞",
	["pe"] = "𐀟",
	["pi"] = "𐀠",
	["po"] = "𐀡",
	["pu"] = "𐀢",
	
	["qa"] = "𐀣",
	["qe"] = "𐀤",
	["qi"] = "𐀥",
	["qo"] = "𐀦",
	-- qu not in Unicode
	
	["ra"] = "𐀨",
	["re"] = "𐀩",
	["ri"] = "𐀪",
	["ro"] = "𐀫",
	["ru"] = "𐀬",
	
	["sa"] = "𐀭",
	["se"] = "𐀮",
	["si"] = "𐀯",
	["so"] = "𐀰",
	["su"] = "𐀱",
	
	["ta"] = "𐀲",
	["te"] = "𐀳",
	["ti"] = "𐀴",
	["to"] = "𐀵",
	["tu"] = "𐀶",
	
	["wa"] = "𐀷",
	["we"] = "𐀸",
	["wi"] = "𐀹",
	["wo"] = "𐀺",
	-- wu not in Unicode
	
	["za"] = "𐀼",
	["ze"] = "𐀽",
	-- zi not in Unicode
	["zo"] = "𐀿",
	-- zu not in Unicode
	
	["ha"] = "𐁀",
	["ai"] = "𐁁",
	["au"] = "𐁂",
	["dwe"] = "𐁃",
	["dwo"] = "𐁄",
	["nwo"] = "𐁅",
	["phu"] = "𐁆",
	["pte"] = "𐁇",
	["rya"] = "𐁈",
	["rai"] = "𐁉",
	["ryo"] = "𐁊",
	["tya"] = "𐁋",
	["twe"] = "𐁌",
	["two"] = "𐁍",
	
	["*18"] = "𐁐",
	["*19"] = "𐁑",
	["*22"] = "𐁒",
	["*34"] = "𐁓",
	["*47"] = "𐁔",
	["*49"] = "𐁕",
	["*56"] = "𐁖",
	["*63"] = "𐁗",
	["*64"] = "𐁘",
	["*79"] = "𐁙",
	["*82"] = "𐁚",
	["*83"] = "𐁛",
	["*86"] = "𐁜",
	["*89"] = "𐁝",
	
}

return replacements