local U = mw.ustring.char

local macron = U(0x304)

local data = {}

data["got"] = {
	[1] = 
		{
		["a"] = "𐌰",
		["b"] = "𐌱",
		["g"] = "𐌲",
		["d"] = "𐌳",
		["e"] = "𐌴",
		["q"] = "𐌵",
		["z"] = "𐌶",
		["h"] = "𐌷",
		["þ"] = "𐌸",
		["i"] = "𐌹",
		["k"] = "𐌺",
		["l"] = "𐌻",
		["m"] = "𐌼",
		["n"] = "𐌽",
		["j"] = "𐌾",
		["u"] = "𐌿",
		["p"] = "𐍀",
	--	[""] = "𐍁",
		["r"] = "𐍂",
		["s"] = "𐍃",
		["t"] = "𐍄",
		["w"] = "𐍅",
		["f"] = "𐍆",
		["x"] = "𐍇",
		["ƕ"] = "𐍈",
		["o"] = "𐍉",
		[macron] = "",
--		[""] = "𐍊",
	},
}

data["got-tr"] = {
	[1] = {
		["e" .. macron] = "e",
		["o" .. macron] = "o",
		["c"] = "þ",
		["v"] = "ƕ",
	},
}

return data