local u = mw.ustring.char

local data = {
	["ar"] = {
		allow_repeated_char = true,
		from = {
			"[أإآ]",
			"ؤ",
			"[ئى]",
			"ة",
			"ء",
		},
		to = {
			"ا",
			"و",
			"ي",
			"ه",
		},
	},
	["arc"] = {
		allow_repeated_char = true,
		from = {
			"ם",
			"ן",
			"ך",
			"ף",
			"ץ",
			"ﭏ",
			"װ",
			"ױ",
			"ײ",
			"[״׳־]",
		},
		to = {
			"מ",
			"נ",
			"כ", 
			"פ",
			"צ",
			"אל",
			"וו",
			"וי",
			"יי",
		}
	},
	["axm"] = {
		from = {"ու"},
		to   = {"ŭ"},
	},
	["ca"] = {
		from = {"à", "[èé]", "[íï]", "[òó]", "[úü]", "ç", "l·l"},
		to   = {"a", "e",    "i",    "o",    "u",    "c", "ll"},
	},
	["cmn"] = {ignore = {"Latn"}},
	["cs"] = {
		from = {"á", "é", "í", "ó", "[úů]", "ý", "ch"},
		to   = {"a", "e", "i", "o", "u",    "y", "χ"},
	},
	["de"] = {
		from = {"ä", "ö", "ü", "[ßẞ]"},
		to   = {"a", "o", "u", "ss"},
	},
	["el"] = {
		from = {
			"[ᾳάᾴὰᾲᾶᾷἀᾀἄᾄἂᾂἆᾆἁᾁἅᾅἃᾃἇᾇᾱᾰἈᾈἌᾌἊᾊἎᾎἉᾉἍᾍἋᾋἏᾏᾹᾸ]", --uppercase characters are included due to this bug: https://bugs.php.net/bug.php?id=69267
			"[έὲἐἔἒἑἕἓἘἜἚἙἝἛ]",
			"[ῃήῄὴῂῆῇἠᾐἤᾔἢᾒἦᾖἡᾑἥᾕἣᾓἧᾗἨᾘἬᾜἪᾚἮᾞἩᾙἭᾝἫᾛἯᾟ]",
			"[ίὶῖἰἴἲἶἱἵἳἷϊΐῒῗῑῐἸἼἺἾἹἽἻἿῙῘ]", 
			"[όὸὀὄὂὁὅὃὈὌὊὉὍὋ]",
			"[ύὺῦὐὔὒὖὑὕὓὗϋΰῢῧῡῠὙὝὛὟῩῨ]",
			"[ῳώῴὼῲῶῷὠᾠὤᾤὢᾢὦᾦὡᾡὥᾥὣᾣὧᾧὨᾨὬᾬὪᾪὮᾮὩᾩὭᾭὫᾫὯᾯ]",
			"[ῥῤῬ]",
			"[ς]",
			"[́͂]"
		},
		to = {
			"α",
			"ε",
			"η",
			"ι",
			"ο",
			"υ",
			"ω",
			"ρ",
			"σ"
		},
	},
	["en"] = {
		from = {"[äàáâåā]", "[ëèéêē]", "[ïìíîī]", "[öòóôō]", "[üùúûū]", "æ" , "œ" , "[çč]", "ñ", "'"},
		to   = {"a",        "e",       "i",       "o",       "u",       "ae", "oe", "c",    "n"},
	},
	["fr"] = {
		from = {"[áàâä]", "[éèêë]", "[íìîï]", "[óòôö]", "[úùûü]", "[ýỳŷÿ]", "ç", "æ",  "œ", "'"},
		to   = {"a",       "e",     "i",      "o",      "u",      "y",      "c", "ae", "oe"},
	},
	["fy"] = {
		from = {"[áàâä]", "[éèêë]", "[íìîï]", "[óòôö]", "[úùûü]", "[ýỳŷÿ]", "æ",  "'"},
		to   = {"a",       "e",     "i",      "o",      "u",      "y",      "ae"},
	},
	["grc"] = {
		from = {
			"[ᾳάᾴὰᾲᾶᾷἀᾀἄᾄἂᾂἆᾆἁᾁἅᾅἃᾃἇᾇᾱᾰἈᾈἌᾌἊᾊἎᾎἉᾉἍᾍἋᾋἏᾏᾹᾸ]", --uppercase characters are included due to this bug: https://bugs.php.net/bug.php?id=69267
			"[έὲἐἔἒἑἕἓἘἜἚἙἝἛ]",
			"[ῃήῄὴῂῆῇἠᾐἤᾔἢᾒἦᾖἡᾑἥᾕἣᾓἧᾗἨᾘἬᾜἪᾚἮᾞἩᾙἭᾝἫᾛἯᾟ]",
			"[ίὶῖἰἴἲἶἱἵἳἷϊΐῒῗῑῐἸἼἺἾἹἽἻἿῙῘ]", 
			"[όὸὀὄὂὁὅὃὈὌὊὉὍὋ]",
			"[ύὺῦὐὔὒὖὑὕὓὗϋΰῢῧῡῠὙὝὛὟῩῨ]",
			"[ῳώῴὼῲῶῷὠᾠὤᾤὢᾢὦᾦὡᾡὥᾥὣᾣὧᾧὨᾨὬᾬὪᾪὮᾮὩᾩὭᾭὫᾫὯᾯ]",
			"[ῥῤῬ]",
			"[ς]",
			"[́͂]"
		},
		to = {
			"α",
			"ε",
			"η",
			"ι",
			"ο",
			"υ",
			"ω",
			"ρ",
			"σ"
		}
	},
	["he"] = {
		allow_repeated_char = true,
		from = {
			"ם",
			"ן",
			"ך",
			"ף",
			"ץ",
			"ﭏ",
			"װ",
			"ױ",
			"ײ",
			"[״׳־]",
		},
		to = {
			"מ",
			"נ",
			"כ", 
			"פ",
			"צ",
			"אל",
			"וו",
			"וי",
			"יי",
		}
	},
	["hu"] = {
		from = {"í", "ó", "ú", "ő", "ű", "ccs", "cs", "ggy", "gy", "lly", "ly", "nny", "ny", "ssz", "sz", "tty", "ty", "zzs", "zs", "ddzs", "dzs"},
		to   = {"i", "o", "u", "ö", "ü", "čč",  "č",  "ǰǰ",  "ǰ",  "ľľ",  "ľ",  "ňň",  "ň",  "šš",  "š",  "ťť",  "ť",  "žž", "ž",  "ddž", "dž"},
	},
	["hy"] = {
		from = {"ու", "եւ"},
		to   = {"ŭ",  "և"},
	},
	["ja"] = {
		allow_repeated_char = true,
		from = {'が', 'ぎ', 'ぐ', 'げ', 'ご', 'ざ', 'じ', 'ず', 'ぜ', 'ぞ', 'だ', 'ぢ', 'づ', 'で', 'ど', 'ば', 'び', 'ぶ', 'べ', 'ぼ', 'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ', 'ゔ'},
		to   = {'か', 'き', 'く', 'け', 'こ', 'さ', 'し', 'す', 'せ', 'そ', 'た', 'ち', 'つ', 'て', 'と', 'は', 'ひ', 'ふ', 'へ', 'ほ', 'は', 'ひ', 'ふ', 'へ', 'ほ', 'う'},
		ignore = {"Latn"},
	},
	["la"] = {
		from = {"v", "j"},
		to   = {"u", "i"}
	},
	["nl"] = {
		from = {"[áàä]", "[éèë]", "[íìï]", "[óòö]", "[úùü]"},
		to   = {"a",     "e",     "i",     "o",     "u"},
	},
	["pl"] = {
		from = {"ć", "ę", "ł", "ń", "ó", "ś", "[źż]"},
		to   = {"c", "e", "l", "n", "o", "s", "z"},
	},
	["ru"] = {
		from = {"ё"},
		to   = {"е"},
	},
	["xcl"] = {
		from = {"ու"},
		to   = {"ŭ"},
	},
	["yi"] = {
		allow_repeated_char = true,
		from = {
			"ם",
			"ן",
			"ך",
			"ף",
			"ץ",
			"ﭏ",
			"װ",
			"ױ",
			"ײ",
			"[״׳־]",
			"[ִַָּֿׁׂ]",
		},
		to = {
			"מ",
			"נ",
			"כ", 
			"פ",
			"צ",
			"אל",
			"וו",
			"וי",
			"יי",
		}
	},
	["zh"] = {
		ignore = {"Latn"},
	},
}

return data